; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v4 - type_1 ?v2 - type_3)
 	      (pred_2 ?v7 - object ?v2 - type_3)
	      (pred_1 ?v4 - type_1 ?v3 - type_2)
	      (pred_3 ?v4 - type_1 ?v7 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v4 - type_1 ?v5 ?v8 - type_3)
       :precondition (and  (pred_4 ?v4 ?v5))
       :effect (and  (pred_4 ?v4 ?v8)
		     (not (pred_4 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_1 ?v1 - object ?v6 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v6) (pred_4 ?v4 ?v6) (pred_1 ?v4 ?v3))
       :effect (and (pred_3 ?v4 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v6)) 
		    (not (pred_1 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_1 ?v1 - object ?v6 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v1 ?v3) (pred_4 ?v4 ?v6))
       :effect (and (pred_2 ?v1 ?v6)
		    (pred_1 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v1 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_04 - type_1
obj_06 obj_09 obj_10 obj_07 - type_2
obj_03 obj_01 obj_05 - type_3
obj_12 obj_08 obj_02 - object)
(:init
(pred_4 obj_11 obj_03)
(pred_1 obj_11 obj_06)
(pred_1 obj_11 obj_09)
(pred_4 obj_04 obj_01)
(pred_1 obj_04 obj_10)
(pred_1 obj_04 obj_07)
(pred_2 obj_12 obj_01)
(pred_2 obj_08 obj_03)
(pred_2 obj_02 obj_03)
)
(:goal
(and
(pred_2 obj_12 obj_01)
(pred_2 obj_08 obj_01)
(pred_2 obj_02 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_11 obj_01) (pred_4 obj_04 obj_01))))
  )
)
)

; plan
1. (op_1 obj_11 obj_08 obj_03 obj_09)
   deleted: (pred_2 obj_08 obj_03) (pred_1 obj_11 obj_09)
   added: (pred_3 obj_11 obj_08 obj_09)
   goals met: 2 of 3
2. (op_2 obj_04 obj_01 obj_03)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_03)
   goals met: 2 of 3
3. (op_2 obj_11 obj_03 obj_01)
   deleted: (pred_4 obj_11 obj_03)
   added: (pred_4 obj_11 obj_01)
   goals met: 2 of 3
4. (op_3 obj_11 obj_08 obj_01 obj_09)
   deleted: (pred_3 obj_11 obj_08 obj_09)
   added: (pred_2 obj_08 obj_01) (pred_1 obj_11 obj_09)
   goals met: 3 of 3
